@atanev Reference 
```
[11/12/25 9:02:26] ➜  tf plan
data.artifactory_local_docker_v2_repository.docker-repo: Reading...
data.artifactory_local_docker_v2_repository.docker-repo: Read complete after 0s [id=docker-test-repo]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # random_id.randid will be created
  + resource "random_id" "randid" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 2
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # xray_repository_config.test will be created
  + resource "xray_repository_config" "test" {
      + jas_enabled = true
      + repo_name   = "docker-test-repo"

      + config {
          + retention_in_days        = 90
          + vuln_contextual_analysis = true

          + exposures {
              + scanners_category {
                  + applications = true
                  + secrets      = true
                  + services     = true
                }
            }
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't guarantee to take exactly these actions if you run "terraform apply" now.
[11/12/25 9:02:30] ➜  tf apply
data.artifactory_local_docker_v2_repository.docker-repo: Reading...
data.artifactory_local_docker_v2_repository.docker-repo: Read complete after 0s [id=docker-test-repo]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # random_id.randid will be created
  + resource "random_id" "randid" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 2
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # xray_repository_config.test will be created
  + resource "xray_repository_config" "test" {
      + jas_enabled = true
      + repo_name   = "docker-test-repo"

      + config {
          + retention_in_days        = 90
          + vuln_contextual_analysis = true

          + exposures {
              + scanners_category {
                  + applications = true
                  + secrets      = true
                  + services     = true
                }
            }
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

random_id.randid: Creating...
random_id.randid: Creation complete after 0s [id=xoU]
xray_repository_config.test: Creating...
xray_repository_config.test: Creation complete after 0s

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.
```